In [1]:
import pandas as pd
import numpy as np

In [2]:
# dictionary of lists
dict = {'Mike':[100, 90, np.nan, 95],
        'John': [30, 45, 56, np.nan],
        'Emily':[np.nan, 40, 80, 98]}

In [3]:
df=pd.DataFrame(dict)

In [4]:
df

    Mike  John  Emily
0  100.0  30.0    NaN
1   90.0  45.0   40.0
2    NaN  56.0   80.0
3   95.0   NaN   98.0

## To Check Any Null Values in a Dataframe,True-Yes False-No

In [9]:
df.isnull()

    Mike   John  Emily
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

## To Get the total Number of null values in a column of a Dataframe

In [11]:
df.isnull().sum()

Mike     1
John     1
Emily    1
dtype: int64

## Removing Null values from a Dataframe

In [13]:
df.dropna()

   Mike  John  Emily
1  90.0  45.0   40.0

## Threshold (Based on the Number of Null Values in a Dataframe)

In [32]:
dict1 = {'Merryl':[100, 90, np.nan, 95,99,96,87,78],
        'Nicole': [30,np.nan,np.nan, np.nan,48,87,90,45],
        'Eva':[np.nan, 40, np.nan, 98,88,23,67,48],
        'Kate':[np.nan, 47, np.nan, 80,81,82,83,84],
        'Naomi':[np.nan, 49, np.nan, 71,72,73,74,75]}

In [33]:
df1=pd.DataFrame(dict1)

In [34]:
df1

   Merryl  Nicole   Eva  Kate  Naomi
0   100.0    30.0   NaN   NaN    NaN
1    90.0     NaN  40.0  47.0   49.0
2     NaN     NaN   NaN   NaN    NaN
3    95.0     NaN  98.0  80.0   71.0
4    99.0    48.0  88.0  81.0   72.0
5    96.0    87.0  23.0  82.0   73.0
6    87.0    90.0  67.0  83.0   74.0
7    78.0    45.0  48.0  84.0   75.0

In [35]:
df1.dropna(thresh=3)

   Merryl  Nicole   Eva  Kate  Naomi
1    90.0     NaN  40.0  47.0   49.0
3    95.0     NaN  98.0  80.0   71.0
4    99.0    48.0  88.0  81.0   72.0
5    96.0    87.0  23.0  82.0   73.0
6    87.0    90.0  67.0  83.0   74.0
7    78.0    45.0  48.0  84.0   75.0

## Filling the Missing Data

In [38]:
df1.fillna(value='Filling the Missing Data with this')

,Merryl,Nicole,Eva,Kate,Naomi
0,100,30,Filling the Missing Data with this,Filling the Missing Data with this,Filling the Missing Data with this
1,90,Filling the Missing Data with this,40,47,49
2,Filling the Missing Data with this,Filling the Missing Data with this,Filling the Missing Data with this,Filling the Missing Data with this,Filling the Missing Data with this
3,95,Filling the Missing Data with this,98,80,71
4,99,48,88,81,72
5,96,87,23,82,73
6,87,90,67,83,74
7,78,45,48,84,75

## Filling the Missing value in the Column with some literals and Mean

In [42]:
df1['Nicole'].fillna(value=0)

0    30.0
1     0.0
2     0.0
3     0.0
4    48.0
5    87.0
6    90.0
7    45.0
Name: Nicole, dtype: float64

In [51]:
df1['Merryl'].fillna(df1['Merryl'].mean())

0    100.000000
1     90.000000
2     92.142857
3     95.000000
4     99.000000
5     96.000000
6     87.000000
7     78.000000
Name: Merryl, dtype: float64

## To Replace all the Missing value in a Dataframe with the mean respective to their column

In [59]:
df1.fillna(df1.mean())

       Merryl  Nicole        Eva       Kate  Naomi
0  100.000000    30.0  60.666667  76.166667   69.0
1   90.000000    60.0  40.000000  47.000000   49.0
2   92.142857    60.0  60.666667  76.166667   69.0
3   95.000000    60.0  98.000000  80.000000   71.0
4   99.000000    48.0  88.000000  81.000000   72.0
5   96.000000    87.0  23.000000  82.000000   73.0
6   87.000000    90.0  67.000000  83.000000   74.0
7   78.000000    45.0  48.000000  84.000000   75.0

In [60]:
df1['Merryl'].mean()

92.14285714285714